benchmarks/benchmark_cpu_tests/benchmark_results_epoll_10KB/epoll_c1000_10kb.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient).....done


Server Software:        
Server Hostname:        localhost
Server Port:            8000

Document Path:          /test_data/10kb.txt
Document Length:        10240 bytes

Concurrency Level:      1000
Time taken for tests:   18.124 seconds
Complete requests:      20000
Failed requests:        0
Keep-Alive requests:    0
Total transferred:      206020000 bytes
HTML transferred:       204800000 bytes
Requests per second:    1103.53 [#/sec] (mean)
Time per request:       906.186 [ms] (mean)
Time per request:       0.906 [ms] (mean, across all concurrent requests)
Transfer rate:          11101.00 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   2.7      0      20
Processing:    24  897  72.7    917     961
Waiting:        1  897  72.7    917     961
Total:         24  897  70.3    917     961

Percentage of the requests served within a certain time (ms)
  50%    917
  66%    921
  75%    924
  80%    930
  90%    939
  95%    952
  98%    958
  99%    960
 100%    961 (longest request)