benchmarks/benchmark_cpu_tests/benchmark_results_epoll_10KB/epoll_c10_10kb.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient).....done


Server Software:        
Server Hostname:        localhost
Server Port:            8000

Document Path:          /test_data/10kb.txt
Document Length:        10240 bytes

Concurrency Level:      10
Time taken for tests:   18.775 seconds
Complete requests:      20000
Failed requests:        0
Keep-Alive requests:    0
Total transferred:      206020000 bytes
HTML transferred:       204800000 bytes
Requests per second:    1065.26 [#/sec] (mean)
Time per request:       9.387 [ms] (mean)
Time per request:       0.939 [ms] (mean, across all concurrent requests)
Transfer rate:          10716.09 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       1
Processing:     1    9   1.6      9      71
Waiting:        1    9   1.6      9      71
Total:          1    9   1.6      9      71

Percentage of the requests served within a certain time (ms)
  50%      9
  66%      9
  75%      9
  80%      9
  90%     10
  95%     10
  98%     10
  99%     11
 100%     71 (longest request)